In [2]:
#import libraries
import pandas as pd

data1 = {"id": [1,2,3], "name": ["Edward", "John", "Albert"], "age": [22, 23, 30]}
df1 = pd.DataFrame(data1)

data2 = {"id": [1,2,3], "City": ["London", "California", "Washington DC"]}
df2 = pd.DataFrame(data2)

In [3]:
#Merging the data

df = pd.merge(df1, df2, on="id", how="inner")
df

   id    name  age           City
0   1  Edward   22         London
1   2    John   23     California
2   3  Albert   30  Washington DC